perfomance/jmeter/Pricing-API-Test-UAT.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.1.1 r1855137">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Pricing Service API Test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">20</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">20</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Pricing Service Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;deliveries&quot;: [&#xd;
    {&#xd;
        &quot;deliveryMethod&quot;: &quot;DOMESTIC_SHIPPING&quot;,&#xd;
        &quot;shippingMethod&quot;: &quot;STANDARD&quot;,&#xd;
        &quot;address&quot;:&#xd;
        {&#xd;
            &quot;line1&quot;: &quot;5500 Windward Pkwy&quot;,&#xd;
            &quot;line2&quot;: &quot;Ste 450&quot;,&#xd;
            &quot;city&quot;: &quot;Alpharetta&quot;,&#xd;
            &quot;stateCode&quot;: &quot;GA&quot;,&#xd;
            &quot;postalCode&quot;: &quot;30004&quot;,&#xd;
            &quot;countryCode&quot;: &quot;US&quot;&#xd;
        },&#xd;
        &quot;products&quot;: [&#xd;
        {&#xd;
            &quot;productId&quot;: &quot;6040083686-29&quot;,&#xd;
            &quot;productType&quot;: &quot;MERCHANDISE&quot;,&#xd;
            &quot;supplierId&quot;: &quot;apple&quot;,&#xd;
            &quot;quantity&quot;: 1,&#xd;
            &quot;basePrice&quot;: &quot;USD 29.00&quot;,&#xd;
            &quot;baseShippingCost&quot;: &quot;USD 0.00&quot;,&#xd;
            &quot;index&quot;: 1066,&#xd;
            &quot;additionalPrices&quot;:&#xd;
            {},&#xd;
            &quot;additionalInfo&quot;:&#xd;
            {&#xd;
                &quot;giftCardDenomination&quot;: &quot;USD 100.00&quot;&#xd;
            },&#xd;
            &quot;applicablePolicies&quot;: [],&#xd;
            &quot;categoryId&quot;: 12115,&#xd;
            &quot;categorizations&quot;: []&#xd;
        }]&#xd;
    }],&#xd;
    &quot;applicablePolicies&quot;: [],&#xd;
    &quot;context&quot;:&#xd;
    {&#xd;
        &quot;partnerCode&quot;: &quot;APPLEGR&quot;,&#xd;
        &quot;varId&quot;: &quot;UA&quot;,&#xd;
        &quot;programId&quot;: &quot;MP&quot;,&#xd;
        &quot;excludedPhases&quot;: [],&#xd;
        &quot;targetCurrencies&quot;: [],&#xd;
        &quot;countryCode&quot;: &quot;US&quot;,&#xd;
        &quot;stateCode&quot;: &quot;GA&quot;,&#xd;
        &quot;orderType&quot;: &quot;online&quot;,&#xd;
        &quot;cartPricing&quot;: false&#xd;
    },&#xd;
    &quot;skipShipping&quot;: false,&#xd;
    &quot;ccBuyInLimits&quot;:&#xd;
    {&#xd;
        &quot;maxPercentage&quot;: 0.5&#xd;
    }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${pricingServer}</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/pricing-server/cart</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">false</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">${folder}/${filename_prefix}price_response_time_graph.csv</stringProp>
            <boolProp name="ResultCollector.success_only_logging">true</boolProp>
            <stringProp name="RespTimeGraph.graphtitle">Pricing Response Graph</stringProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">${folder}/${filename_prefix}price_result.csv</stringProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">${folder}/${filename_prefix}price_graph.csv</stringProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Product Service" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${productServer}</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/search/apple-us-en?withVariations=true</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">${folder}/${filename_prefix}product_response_time_graph.csv</stringProp>
            <boolProp name="ResultCollector.success_only_logging">true</boolProp>
            <stringProp name="RespTimeGraph.graphtitle">Product Service Response Graph</stringProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">${folder}/${filename_prefix}product_result.csv</stringProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">${folder}/${filename_prefix}product_graph.csv</stringProp>
          </ResultCollector>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="pricingServer" elementType="Argument">
            <stringProp name="Argument.name">pricingServer</stringProp>
            <stringProp name="Argument.value">pricing-vip.apluat.bridge2solutions.net</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="productServer" elementType="Argument">
            <stringProp name="Argument.name">productServer</stringProp>
            <stringProp name="Argument.value">ps-vip.apluat.bridge2solutions.net</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="filename_prefix" elementType="Argument">
            <stringProp name="Argument.name">filename_prefix</stringProp>
            <stringProp name="Argument.value">UAT</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="folder" elementType="Argument">
            <stringProp name="Argument.name">folder</stringProp>
            <stringProp name="Argument.value">uat</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>